"""
1. **Яка рiзниця мiж mutable/immutable types? до якого типу даних вiдноситься лист?**
2. **Що таке tuple в Python і як він відрізняється від list?**
3. **Як можна створити пустий tuple і заповнити його елементами?**
4. **Чому tuple є незмінним (immutable) типом даних і в яких випадках він корисний?**
5. **Як ви перевіряєте наявність конкретного елемента в tuple?**
6. **Як ви виконуєте зріз (slicing) для отримання підмножини елементів з tuple?**
7. **Що таке list в Python і як він використовується?**
8. **Як ви створюєте пустий list і додаєте елементи до нього?**
9. **Як можна видалити елемент з list?**
10. **В чому відмінність між extend() та append() методами для list?**
11. **Що таке Set в Python і які його особливості?**
12. **Як можливо додавати/видаляти елементи з set?**
13. **Чому set не може містити дублікати елементів і як це може бути корисним?**
14. **Що таке dict (словник) в Python і як він використовується для зберігання даних?**
15. **Як створити пустий dict і додати пари ключ-значення до нього?**
16. **Як ви отримуєте значення за ключем та як перевірити наявність ключа в словнику?**
17. **Що таке методи keys(), values() та items() у словнику і як вони використовуються?**
18. **Як ви видаляєте пару ключ-значення з dict?**
19. **Чому неможлово змiнювати dict пiд час iтерування по ньому?**
20. **Якi правила icнують для формування ключiв dict?**
21. **В чому полягає різниця між tuple, list, set і dict, і як обрати відповідний тип даних для конкретної задачі?**
"""


# In [28]: d1 = {[1,2,3]:2,2:3,3:4}
# ---------------------------------------------------------------------------
# TypeError                                 Traceback (most recent call last)
# Cell In[28], line 1
# ----> 1 d1 = {[1,2,3]:2,2:3,3:4}
#
# TypeError: unhashable type: 'list'
#
# In [29]: d1 = {(1,2,3):2,2:3,3:4}
#
# In [30]: d1 = {(1,2,[3,8]):2,2:3,3:4}
# ---------------------------------------------------------------------------
# TypeError                                 Traceback (most recent call last)
# Cell In[30], line 1
# ----> 1 d1 = {(1,2,[3,8]):2,2:3,3:4}
#
# TypeError: unhashable type: 'list'

